landmark = [
    {
        "id": 0,
        "zh": "中央广播电视台",
        "en": "China_Central_Television_Headquarters",
        "bdcoor": (116.47107,39.920893),
        "bdxy": (12965641.27973324, 4826775.687941284)
    },
    {
        "id": 1,
        "zh": "中信大厦",
        "en": "Beijing_Zhoxin_Building",
        "bocoor": (116.472794, 39.918568),
        "bdxy": (12965833.196623523, 4826439.565347422)
    },
    {
        "id": 2,
        "zh": "人民日报新媒体大厦",
        "en": "Peoples_Daily_New_Media_Building",
        "bdcoor": (116.477275,39.925373),
        "bdxy": (12966332.024689281, 4827423.388864538)
    },
    {
        "id": 3,
        "zh": "温特莱中心大厦",
        "en": "Winterlay_Center_Building",
        "bdcoor": (116.483385,39.918864),
        "bdxy": (12967012.194178628, 4826482.357090237)
    },
    {
        "id": 4,
        "zh": "北京银泰中心大厦",
        "en": "Beijing_Yintai_Center",
        "bdcoor": (116.465813,39.913205),
        "bdxy": (12965056.066802716, 4825664.2864299845)
    },
    {
        "id": 5,
        "zh": "北京骏豪大厦",
        "en": "Beijing_Junhao_Building",
        "bdcoor": (116.483892,39.938316),
        "bdxy": (12967068.633774552, 4829294.877358328)
    },
    {
        "id": 6,
        "zh": "北京博瑞大厦",
        "en": "Beijing_Borui_Building",
        "bdcoor": (116.469023,39.93378),
        "bdxy": (12965413.406256204, 4828638.955445829)
    },
    {
        "id": 7,
        "zh": "北京国安大厦",
        "en": "Beijing_Guoan_Building",
        "bdcoor": (116.459908,39.927812),
        "bdxy": (12964398.718057282, 4827776.027930183)
    },
    {
        "id": 8,
        "zh": "北京中宏大厦",
        "en": "Beijing_Zhohong_Building",
        "bdcoor": (116.495079,39.920691),
        "bdxy": (12968313.97846806, 4826746.484575742)
    },
    {
        "id": 9,
        "zh": "北京金隅大成国际中心",
        "en": "BBMG_Dacheng_International_Center",
        "bdcoor": (116.498568,39.906029),
        "bdxy": (12968702.376397412, 4824627.014709551)
    },
    {
        "id": 10,
        "zh": "东方明珠广播电视塔",
        "en": "Oriental_Pearl_Tower",
        "bdcoor": (121.506379,31.245414),
        "bdxy": (13526175.41250546, 3642294.7847743216)
    },
    {
        "id": 11,
        "zh": "上海中心大厦",
        "en": "Shanghai_Center_Building",
        "bdcoor": (121.511937,31.239212), 
        "bdxy": (13526794.132967293, 3641491.2716850527)
    },
    {
        "id": 12,
        "zh": "上海人寿金融中心",
        "en": "Shanghai_China_Life_Financial_Center",
        "bdcoor": (121.517556,31.246425),
        "bdxy": (13527419.643991949, 3642425.7720466526)
    },
    {
        "id": 13,
        "zh": "上海航运金融大厦",
        "en": "Shanghai_International_Shipping_Finance_Building",
        "bdcoor": (121.531339,31.245756),
        "bdxy": (13528953.977227902, 3642339.0948503683)
    },
    {
        "id": 14,
        "zh": "上海滨江万科中心",
        "en": "Shanghai_Binjiang_Vanke_Building",
        "bdcoor": (121.545497,31.251138), 
        "bdxy": (13530530.055727115, 3643036.41686512)
    },
    {
        "id": 15,
        "zh": "上海鄂尔多斯艾力大厦",
        "en": "Shanghai_Ordos_Aili_Building",
        "bdcoor": (121.545431,31.239883), 
        "bdxy": (13530522.70856078, 3641578.2019236763)
    },
    {
        "id": 16,
        "zh": "上海海关大楼",
        "en": "Shanghai_China_Customs_Building",
        "bdcoor": (121.554801,31.231915),
        "bdxy": (13531565.783538718, 3640545.9617972905)
    },
    {
        "id": 17,
        "zh": "上海证券交易大厦",
        "en": "Shanghai_Stock_Exchange_Building",
        "bdcoor": (121.542023,31.226405),
        "bdxy": (13530143.327608295, 3639832.202583741)
    },
    {
        "id": 18,
        "zh": "上海江苏大厦",
        "en": "Shanghai_Jiangsu_Building",
        "bdcoor": (121.529979,31.233595),
        "bdxy": (13528802.581073154, 3640763.5954731205)
    },
    {
        "id": 19,
        "zh": "上海华融大厦",
        "en": "Shanghai_Huarong_Building",
        "bdcoor": (121.523906,31.232111),
        "bdxy": (13528126.530449782, 3640571.3521914287)
    },
    {
        "id": 20,
        "zh": "埃菲尔铁塔",
        "en": "Eiffel Tower",
        "bdcoor": (121.523906,31.232111),
        "bdxy": (255424.35227305553, 6218368.657363752)
    },
    {
        "id": 21,
        "zh": "荣军院",
        "en": "Hotel des Invalides",
        "bdcoor": (121.523906, 31.232111),
        "bdxy": (257435.36075505076, 6217806.728687864)
    },
    {
        "id": 22,
        "zh": "凯旋门",
        "en": "Arc de Triomphe",
        "bdcoor": (121.523906, 31.232111),
        "bdxy": (255485.80130057075, 6220987.663524565)
    },
    {
        "id": 23,
        "zh": "巴黎歌剧院",
        "en": "Palais Garnier",
        "bdcoor": (121.523906, 31.232111),
        "bdxy": (259592.86728090455, 6220594.81112834)
    },
    {
        "id": 24,
        "zh": "蒙帕纳斯大楼",
        "en": "Montparnasse Tower",
        "bdcoor": (121.523906, 31.232111),
        "bdxy": (258481.21875053068, 6215640.3404101925)
    },
    {
        "id": 25,
        "zh": "亚历山大三世桥",
        "en": "Pont Alexandre",
        "bdcoor": (121.523906, 31.232111),
        "bdxy": (257546.57013636897, 6219275.818836404)
    },
    {
        "id": 26,
        "zh": "埃菲尔铁塔",
        "en": "Eiffel Tower",
        "bdcoor": (121.523906, 31.232111),
        "bdxy": (13528126.530449782, 3640571.3521914287)
    },
    {
        "id": 27,
        "zh": "埃菲尔铁塔",
        "en": "Eiffel Tower",
        "bdcoor": (121.523906, 31.232111),
        "bdxy": (13528126.530449782, 3640571.3521914287)
    },
    {
        "id": 28,
        "zh": "埃菲尔铁塔",
        "en": "Eiffel Tower",
        "bdcoor": (121.523906, 31.232111),
        "bdxy": (13528126.530449782, 3640571.3521914287)
    },
    {
        "id": 29,
        "zh": "埃菲尔铁塔",
        "en": "Eiffel Tower",
        "bdcoor": (121.523906, 31.232111),
        "bdxy": (13528126.530449782, 3640571.3521914287)
    },
    {
        "id": 30,
        "zh": "帝国大厦",
        "en": "Empire State Building",
        "bdcoor": (121.523906, 31.232111),
        "bdxy": (-8236138.952507993, 4947155.459369732)
    },
    {
        "id": 31,
        "zh": "克莱斯勒大厦",
        "en": "Chrysler Building",
        "bdcoor": (121.523906, 31.232111),
        "bdxy": (-8235004.817195804, 4947619.754553663)
    },
    {
        "id": 32,
        "zh": "大都会保险公司大厦",
        "en": "MetLife Building",
        "bdcoor": (121.523906, 31.232111),
        "bdxy": (-8235144.52467684, 4947898.605863982)
    },
    {
        "id": 33,
        "zh": "时代华纳中心",
        "en": "Deutsche Bank Center",
        "bdcoor": (121.523906, 31.232111),
        "bdxy": (-8235855.975283455, 4950089.44236103)
    },
    {
        "id": 34,
        "zh": "赫斯特大楼",
        "en": "Hearst Tower",
        "bdcoor": (121.523906, 31.232111),
        "bdxy": (-8235894.82620846, 4949825.0223507555)
    },
    {
        "id": 35,
        "zh": "环球广场一号",
        "en": "Worldwide Plaza",
        "bdcoor": (121.523906, 31.232111),
        "bdxy": (-8236274.87508516, 4949154.048815555)
    },
    {
        "id": 36,
        "zh": "纽约时报大厦",
        "en": "New York Times Building",
        "bdcoor": (121.523906, 31.232111),
        "bdxy": (-8236628.986238289, 4948269.834591158)
    },
    {
        "id": 37,
        "zh": "宾州广场一号",
        "en": "PENN Building",
        "bdcoor": (121.523906, 31.232111),
        "bdxy": (-8236956.4917436335, 4947612.435730071)
    },
    {
        "id": 38,
        "zh": "詹姆斯法利邮政大楼",
        "en": "United States Postal Service",
        "bdcoor": (121.523906, 31.232111),
        "bdxy": (-8237199.950118953, 4947567.937402008)
    },
    {
        "id": 39,
        "zh": "麦迪逊一号",
        "en": "Madison Building",
        "bdcoor": (121.523906, 31.232111),
        "bdxy": (-8236410.241058818, 4946007.4053196935)
    },
]